app/controllers/pins_controller.rb

INSERT INTO "pins" ("name", "url", "image", "comment", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
  	@pin = Pin.new(pin_params)
  	@pin.save